Revit 2026 API

# MultiReferenceAnnotationOptionsDimensionStyleType Property

---

The dimension style type to be used by the new MultiReferenceAnnotation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DimensionStyleType DimensionStyleType { get; set; }
```
```vb
Public Property DimensionStyleType As DimensionStyleType
	Get
	Set
```
```cpp
public:
property DimensionStyleType DimensionStyleType {
	DimensionStyleType get ();
	void set (DimensionStyleType value);
}
```
```fsharp
member DimensionStyleType : DimensionStyleType with get, set
```

#### Property Value

DimensionStyleType

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: dimensionStyleType must be either Linear or LinearFixed to be used by MultiReferenceAnnotations. |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

Only Linear and LinearFixed types are allowed.

#### Reference

MultiReferenceAnnotationOptions Class

Autodesk.Revit.DB Namespace